RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DCM_GPR.h
/*
** ###################################################################
**     Processor:           S32K344
**     Reference manual:    S32K3xx RM Rev.3
**     Version:             rev. 1.9, 2021-10-27
**     Build:               b211026
**
**     Abstract:
**         Peripheral Access Layer for S32K344
**
**     Copyright 1997-2016 Freescale Semiconductor, Inc.
**     Copyright 2016-2021 NXP
**
**     NXP Confidential. This software is owned or controlled by NXP and may only be
**     used strictly in accordance with the applicable license terms. By expressly
**     accepting such terms or by downloading, installing, activating and/or otherwise
**     using the software, you are agreeing that you have read, and that you agree to
**     comply with and are bound by, such license terms. If you do not agree to be
**     bound by the applicable license terms, then you may not retain, install,
**     activate or otherwise use the software. The production use license in
**     Section 2.3 is expressly granted for this software.
**
**     http:                 www.nxp.com
**     mail:                 support@nxp.com
**
** ###################################################################
*/

/*!
 * @file S32K344_DCM_GPR.h
 * @version 1.9
 * @date 2021-10-27
 * @brief Peripheral Access Layer for S32K344_DCM_GPR
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K344_DCM_GPR_H_)  /* Check if memory map has not been already included */
#define S32K344_DCM_GPR_H_

#include "S32K344_COMMON.h"

/* ----------------------------------------------------------------------------
   -- DCM_GPR Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup DCM_GPR_Peripheral_Access_Layer DCM_GPR Peripheral Access Layer
 * @{
 */

/** DCM_GPR - Register Layout Typedef */
typedef struct {
  uint8_t RESERVED_0[512];
  __IO uint32_t DCMROD1;                           /**< Read Only GPR On Destructive Reset Register, offset: 0x200 */
  uint8_t RESERVED_1[4];
  __IO uint32_t DCMROD3;                           /**< Read Only GPR On Destructive Reset Register, offset: 0x208 */
  __IO uint32_t DCMROD4;                           /**< Read Only GPR On Destructive Reset Register, offset: 0x20C */
  __IO uint32_t DCMROD5;                           /**< Read Only GPR On Destructive Reset Register, offset: 0x210 */
  uint8_t RESERVED_2[236];
  __IO uint32_t DCMROF1;                           /**< Read Only GPR On Functional Reset Register, offset: 0x300 */
  __IO uint32_t DCMROF2;                           /**< Read Only GPR On Functional Reset Register, offset: 0x304 */
  __IO uint32_t DCMROF3;                           /**< Read Only GPR On Functional Reset Register, offset: 0x308 */
  __IO uint32_t DCMROF4;                           /**< Read Only GPR On Functional Reset Register, offset: 0x30C */
  __IO uint32_t DCMROF5;                           /**< Read Only GPR On Functional Reset Register, offset: 0x310 */
  __IO uint32_t DCMROF6;                           /**< Read Only GPR On Functional Reset Register, offset: 0x314 */
  __IO uint32_t DCMROF7;                           /**< Read Only GPR On Functional Reset Register, offset: 0x318 */
  __IO uint32_t DCMROF8;                           /**< Read Only GPR On Functional Reset Register, offset: 0x31C */
  __IO uint32_t DCMROF9;                           /**< Read Only GPR On Functional Reset Register, offset: 0x320 */
  __IO uint32_t DCMROF10;                          /**< Read Only GPR On Functional Reset Register, offset: 0x324 */
  __IO uint32_t DCMROF11;                          /**< Read Only GPR On Functional Reset Register, offset: 0x328 */
  __IO uint32_t DCMROF12;                          /**< Read Only GPR On Functional Reset Register, offset: 0x32C */
  __IO uint32_t DCMROF13;                          /**< Read Only GPR On Functional Reset Register, offset: 0x330 */
  __IO uint32_t DCMROF14;                          /**< Read Only GPR On Functional Reset Register, offset: 0x334 */
  __IO uint32_t DCMROF15;                          /**< Read Only GPR On Functional Reset Register, offset: 0x338 */
  __IO uint32_t DCMROF16;                          /**< Read Only GPR On Functional Reset Register, offset: 0x33C */
  __IO uint32_t DCMROF17;                          /**< Read Only GPR On Functional Reset Register, offset: 0x340 */
  uint8_t RESERVED_3[4];
  __I  uint32_t DCMROF19;                          /**< Read Only GPR On Functional Reset Register, offset: 0x348 */
  __I  uint32_t DCMROF20;                          /**< Read Only GPR On Functional Reset Register, offset: 0x34C */
  __I  uint32_t DCMROF21;                          /**< Read Only GPR On Functional Reset Register, offset: 0x350 */
  uint8_t RESERVED_4[172];
  __IO uint32_t DCMRWP1;                           /**< Read Write GPR On Power On Reset Register, offset: 0x400 */
  uint8_t RESERVED_5[4];
  __IO uint32_t DCMRWP3;                           /**< Read Write GPR On Power On Reset Register, offset: 0x408 */
  uint8_t RESERVED_6[248];
  __IO uint32_t DCMRWD2;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x504 */
  __IO uint32_t DCMRWD3;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x508 */
  __IO uint32_t DCMRWD4;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x50C */
  __IO uint32_t DCMRWD5;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x510 */
  __IO uint32_t DCMRWD6;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x514 */
       uint32_t DCMRWD7;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x518 */
       uint32_t DCMRWD8;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x51C */
       uint32_t DCMRWD9;                           /**< Read Write GPR On Destructive Reset Register, offset: 0x520 */
  uint8_t RESERVED_7[220];
  __IO uint32_t DCMRWF1;                           /**< Read Write GPR On Functional Reset Register, offset: 0x600 */
  __IO uint32_t DCMRWF2;                           /**< Read Write GPR On Functional Reset Register, offset: 0x604 */
  uint8_t RESERVED_8[4];
  __IO uint32_t DCMRWF4;                           /**< Read Write GPR On Functional Reset Register, offset: 0x60C */
  __IO uint32_t DCMRWF5;                           /**< Read Write GPR On Functional Reset Register, offset: 0x610 */
  uint8_t RESERVED_9[236];
  __IO uint32_t DCMROPP1;                          /**< Read Only GPR On PMCPOR Reset, offset: 0x700 */
  __IO uint32_t DCMROPP2;                          /**< Read Only GPR On PMCPOR Reset, offset: 0x704 */
  __IO uint32_t DCMROPP3;                          /**< Read Only GPR On PMCPOR Reset, offset: 0x708 */
  __IO uint32_t DCMROPP4;                          /**< Read Only GPR On PMCPOR Reset, offset: 0x70C */
} DCM_GPR_Type, *DCM_GPR_MemMapPtr;

/** Number of instances of the DCM_GPR module. */
#define DCM_GPR_INSTANCE_COUNT                   (1u)

