RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DCM_GPR.h
#define DCM_GPR_DCMROPP1_POR_WDG_STAT31_MASK     (0x80000000U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT31_SHIFT    (31U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT31_WIDTH    (1U)
#define DCM_GPR_DCMROPP1_POR_WDG_STAT31(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP1_POR_WDG_STAT31_SHIFT)) & DCM_GPR_DCMROPP1_POR_WDG_STAT31_MASK)
/*! @} */

/*! @name DCMROPP2 - Read Only GPR On PMCPOR Reset */
/*! @{ */

#define DCM_GPR_DCMROPP2_POR_WDG_STAT32_MASK     (0x1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT32_SHIFT    (0U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT32_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT32(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT32_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT32_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT33_MASK     (0x2U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT33_SHIFT    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT33_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT33(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT33_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT33_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT34_MASK     (0x4U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT34_SHIFT    (2U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT34_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT34(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT34_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT34_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT35_MASK     (0x8U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT35_SHIFT    (3U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT35_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT35(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT35_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT35_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT36_MASK     (0x10U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT36_SHIFT    (4U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT36_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT36(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT36_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT36_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT37_MASK     (0x20U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT37_SHIFT    (5U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT37_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT37(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT37_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT37_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT38_MASK     (0x40U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT38_SHIFT    (6U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT38_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT38(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT38_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT38_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT39_MASK     (0x80U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT39_SHIFT    (7U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT39_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT39(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT39_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT39_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT40_MASK     (0x100U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT40_SHIFT    (8U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT40_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT40(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT40_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT40_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT41_MASK     (0x200U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT41_SHIFT    (9U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT41_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT41(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT41_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT41_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT42_MASK     (0x400U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT42_SHIFT    (10U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT42_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT42(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT42_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT42_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT43_MASK     (0x800U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT43_SHIFT    (11U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT43_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT43(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT43_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT43_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT44_MASK     (0x1000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT44_SHIFT    (12U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT44_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT44(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT44_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT44_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT45_MASK     (0x2000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT45_SHIFT    (13U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT45_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT45(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT45_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT45_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT46_MASK     (0x4000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT46_SHIFT    (14U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT46_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT46(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT46_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT46_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT47_MASK     (0x8000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT47_SHIFT    (15U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT47_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT47(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT47_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT47_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT48_MASK     (0x10000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT48_SHIFT    (16U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT48_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT48(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT48_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT48_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT49_MASK     (0x20000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT49_SHIFT    (17U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT49_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT49(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT49_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT49_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT50_MASK     (0x40000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT50_SHIFT    (18U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT50_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT50(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT50_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT50_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT51_MASK     (0x80000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT51_SHIFT    (19U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT51_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT51(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT51_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT51_MASK)

