RT-Thread/rt-thread/bsp/nxp/S32K3/S32K344/libraries/BaseNXP_TS_T40D34M50I0R0/header/S32K344_DCM_GPR.h
#define DCM_GPR_DCMROPP2_POR_WDG_STAT52_MASK     (0x100000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT52_SHIFT    (20U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT52_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT52(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT52_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT52_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT53_MASK     (0x200000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT53_SHIFT    (21U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT53_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT53(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT53_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT53_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT54_MASK     (0x400000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT54_SHIFT    (22U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT54_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT54(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT54_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT54_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT55_MASK     (0x800000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT55_SHIFT    (23U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT55_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT55(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT55_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT55_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT56_MASK     (0x1000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT56_SHIFT    (24U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT56_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT56(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT56_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT56_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT57_MASK     (0x2000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT57_SHIFT    (25U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT57_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT57(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT57_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT57_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT58_MASK     (0x4000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT58_SHIFT    (26U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT58_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT58(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT58_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT58_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT59_MASK     (0x8000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT59_SHIFT    (27U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT59_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT59(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT59_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT59_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT60_MASK     (0x10000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT60_SHIFT    (28U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT60_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT60(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT60_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT60_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT61_MASK     (0x20000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT61_SHIFT    (29U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT61_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT61(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT61_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT61_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT62_MASK     (0x40000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT62_SHIFT    (30U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT62_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT62(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT62_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT62_MASK)

#define DCM_GPR_DCMROPP2_POR_WDG_STAT63_MASK     (0x80000000U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT63_SHIFT    (31U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT63_WIDTH    (1U)
#define DCM_GPR_DCMROPP2_POR_WDG_STAT63(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP2_POR_WDG_STAT63_SHIFT)) & DCM_GPR_DCMROPP2_POR_WDG_STAT63_MASK)
/*! @} */

/*! @name DCMROPP3 - Read Only GPR On PMCPOR Reset */
/*! @{ */

#define DCM_GPR_DCMROPP3_POR_WDG_STAT64_MASK     (0x1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT64_SHIFT    (0U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT64_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT64(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT64_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT64_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT65_MASK     (0x2U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT65_SHIFT    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT65_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT65(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT65_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT65_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT66_MASK     (0x4U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT66_SHIFT    (2U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT66_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT66(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT66_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT66_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT67_MASK     (0x8U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT67_SHIFT    (3U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT67_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT67(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT67_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT67_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT68_MASK     (0x10U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT68_SHIFT    (4U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT68_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT68(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT68_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT68_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT69_MASK     (0x20U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT69_SHIFT    (5U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT69_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT69(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT69_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT69_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT70_MASK     (0x40U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT70_SHIFT    (6U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT70_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT70(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT70_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT70_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT71_MASK     (0x80U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT71_SHIFT    (7U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT71_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT71(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT71_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT71_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT72_MASK     (0x100U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT72_SHIFT    (8U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT72_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT72(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT72_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT72_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT73_MASK     (0x200U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT73_SHIFT    (9U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT73_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT73(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT73_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT73_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT74_MASK     (0x400U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT74_SHIFT    (10U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT74_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT74(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT74_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT74_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT75_MASK     (0x800U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT75_SHIFT    (11U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT75_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT75(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT75_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT75_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT76_MASK     (0x1000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT76_SHIFT    (12U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT76_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT76(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT76_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT76_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT77_MASK     (0x2000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT77_SHIFT    (13U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT77_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT77(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT77_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT77_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT78_MASK     (0x4000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT78_SHIFT    (14U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT78_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT78(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT78_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT78_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT79_MASK     (0x8000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT79_SHIFT    (15U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT79_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT79(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT79_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT79_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT80_MASK     (0x10000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT80_SHIFT    (16U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT80_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT80(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT80_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT80_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT81_MASK     (0x20000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT81_SHIFT    (17U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT81_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT81(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT81_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT81_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT82_MASK     (0x40000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT82_SHIFT    (18U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT82_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT82(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT82_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT82_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT83_MASK     (0x80000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT83_SHIFT    (19U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT83_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT83(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT83_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT83_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT84_MASK     (0x100000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT84_SHIFT    (20U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT84_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT84(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT84_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT84_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT85_MASK     (0x200000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT85_SHIFT    (21U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT85_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT85(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT85_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT85_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT86_MASK     (0x400000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT86_SHIFT    (22U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT86_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT86(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT86_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT86_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT87_MASK     (0x800000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT87_SHIFT    (23U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT87_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT87(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT87_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT87_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT88_MASK     (0x1000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT88_SHIFT    (24U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT88_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT88(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT88_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT88_MASK)

#define DCM_GPR_DCMROPP3_POR_WDG_STAT89_MASK     (0x2000000U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT89_SHIFT    (25U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT89_WIDTH    (1U)
#define DCM_GPR_DCMROPP3_POR_WDG_STAT89(x)       (((uint32_t)(((uint32_t)(x)) << DCM_GPR_DCMROPP3_POR_WDG_STAT89_SHIFT)) & DCM_GPR_DCMROPP3_POR_WDG_STAT89_MASK)

